1s/ERP/Conf/Catalogs/Лико_ПравилаСписанияНоменклатурыПодЗаказ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Лико_ПравилаСписанияНоменклатурыПодЗаказ</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Выключить</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>11</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СложнаяНастройка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтборНастройки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодЗаказ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КатегорияЭксплуатации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииЭксплуатации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСписания</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Лико_ТипыСписанияНоменклатурыВПроизводство</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаПравил</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Исключить</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

1s/ERP/Conf/Catalogs/Лико_МастерНастройкиСтатьиРасходаДляНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Лико_МастерНастройкиСтатьиРасходаДляНоменклатуры</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Выключить</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяРасхода</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>11</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СложнаяНастройка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтборНастройки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Исключить</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

1s/ERP/Conf/Catalogs/Лико_ПравилаСписанияНоменклатурыПодЗаказ/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


#Область ПрограммныйИнтерфейс


Функция СписаниеНаЗаказ(Номенклатура,ДокументРасхода=Неопределено) Экспорт
	Структура = Новый Структура;
	Структура.Вставить("ТипСписания");
	Структура.Вставить("КатегорияЭксплуатации");
	
	Если ДокументРасхода=Неопределено Тогда
		ДокументРасхода=Документы.Лико_ПередачаТоваров.ПустаяСсылка();
	КонецЕсли;
	СтатьяРасходов=Неопределено;	
	Запрос = Новый Запрос;
	Запрос.Текст=ТекстЗапросаПравилПоВидуНоменклатуры(); 
	Запрос.УстановитьПараметр("ВидНоменклатуры",Номенклатура.ВидНоменклатуры );
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл 		
		ИспользоватьЭтоПравило=Истина;	
		Если Выборка.СложнаяНастройка Тогда 
			ИспользоватьЭтоПравило= ИспользоватьПравилоСКД(Выборка,Номенклатура,ДокументРасхода);		
			
		Иначе
			Для каждого ДопРеквизит Из Выборка.Ссылка.ДополнительныеРеквизиты Цикл			
				Если ЗначениеЗаполнено(ДопРеквизит.Значение) ТОгда
					Структура = Новый Структура;
					Структура.Вставить("Свойство",ДопРеквизит.Свойство);
					Структура.Вставить("Значение",ДопРеквизит.Значение);
					НайденоСвойство=Номенклатура.ДополнительныеРеквизиты.НайтиСтроки(Структура).Количество()>0;
					ЕСли  НайденоСвойство и ДопРеквизит.Исключить ТОгда
						ИспользоватьЭтоПравило=Ложь;
						Прервать;
					ИначеЕсли НЕ НайденоСвойство и НЕ  ДопРеквизит.Исключить ТОгда
						ИспользоватьЭтоПравило=Ложь; 
						Прервать;				
					КонецЕсли;				
				КонецЕсли;
			КонецЦикла; 
		КонецЕсли;
		
		Если ИспользоватьЭтоПравило Тогда
			ЗаполнитьЗначенияСвойств(Структура,Выборка);
			Возврат Структура;
		КонецЕсли;			
		
	КонецЦикла;
	
	Возврат Структура;
КонецФункции

Функция СписаниеВЗаказ(Номенклатура) Экспорт 

	УстановитьПривилегированныйРежим(Истина);
	СтатьяРасходов=Неопределено;	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЛикоМастерНастройкиСтатьиРасходаДляНоменклатуры.Ссылка КАК Ссылка,
	|	ЛикоМастерНастройкиСтатьиРасходаДляНоменклатуры.ВерсияДанных КАК ВерсияДанных,
	|	ЛикоМастерНастройкиСтатьиРасходаДляНоменклатуры.ПометкаУдаления КАК ПометкаУдаления,
	|	ЛикоМастерНастройкиСтатьиРасходаДляНоменклатуры.Код КАК Код,
	|	ЛикоМастерНастройкиСтатьиРасходаДляНоменклатуры.Наименование КАК Наименование,
	|	ЛикоМастерНастройкиСтатьиРасходаДляНоменклатуры.Выключить КАК Выключить,
	|	ЛикоМастерНастройкиСтатьиРасходаДляНоменклатуры.Организация КАК Организация,
	|	ЛикоМастерНастройкиСтатьиРасходаДляНоменклатуры.ВидНоменклатуры КАК ВидНоменклатуры,
	|	ЛикоМастерНастройкиСтатьиРасходаДляНоменклатуры.Описание КАК Описание,
	|	ЛикоМастерНастройкиСтатьиРасходаДляНоменклатуры.Предопределенный КАК Предопределенный,
	|	ЛикоМастерНастройкиСтатьиРасходаДляНоменклатуры.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных
	|ИЗ
	|	Справочник.Лико_ПравилаСписанияНоменклатурыПодЗаказ КАК ЛикоМастерНастройкиСтатьиРасходаДляНоменклатуры
	|ГДЕ
	|	ЛикоМастерНастройкиСтатьиРасходаДляНоменклатуры.ВидНоменклатуры = &ВидНоменклатуры
	|	И НЕ ЛикоМастерНастройкиСтатьиРасходаДляНоменклатуры.ПометкаУдаления
	|	И НЕ ЛикоМастерНастройкиСтатьиРасходаДляНоменклатуры.Выключить";
	Запрос.УстановитьПараметр("ВидНоменклатуры",Номенклатура.ВидНоменклатуры );
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл 		
		ИспользоватьЭтоПравило=Истина;	
		Для каждого ДопРеквизит Из Выборка.Ссылка.ДополнительныеРеквизиты Цикл			
			Если ЗначениеЗаполнено(ДопРеквизит.Значение) ТОгда
				Структура = Новый Структура;
				Структура.Вставить("Свойство",ДопРеквизит.Свойство);
				Структура.Вставить("Значение",ДопРеквизит.Значение);
				НайденоСвойство=Номенклатура.ДополнительныеРеквизиты.НайтиСтроки(Структура).Количество()>0;
				ЕСли  НайденоСвойство и ДопРеквизит.Исключить ТОгда
					ИспользоватьЭтоПравило=Ложь;
					Прервать;
				ИначеЕсли НЕ НайденоСвойство и НЕ  ДопРеквизит.Исключить ТОгда
					ИспользоватьЭтоПравило=Ложь; 
					Прервать;				
				КонецЕсли;				
			КонецЕсли;
		КонецЦикла; 
		Если ИспользоватьЭтоПравило Тогда
			Возврат Истина;
		КонецЕсли;			
		
	КонецЦикла;
	
	Возврат Ложь ;

КонецФункции

Функция ОпределитьПравило(Номенклатура, ДокументРасхода = Неопределено) Экспорт 
	УстановитьПривилегированныйРежим(Истина);
	Если ДокументРасхода=Неопределено Тогда
		ДокументРасхода=Документы.Лико_ПередачаТоваров.ПустаяСсылка();
	КонецЕсли;
	СтатьяРасходов=Неопределено;	
	Запрос = Новый Запрос;
	Запрос.Текст=ТекстЗапросаПравилПоВидуНоменклатуры(); 
	Запрос.УстановитьПараметр("ВидНоменклатуры",Номенклатура.ВидНоменклатуры );
	Запрос.УстановитьПараметр("Организация",ДокументРасхода.Организация );

	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл 		
		ИспользоватьЭтоПравило=Истина;	
		Если Выборка.СложнаяНастройка Тогда 
		ИспользоватьЭтоПравило= ИспользоватьПравилоСКД(Выборка,Номенклатура,ДокументРасхода);		
			
		Иначе
			Для каждого ДопРеквизит Из Выборка.Ссылка.ДополнительныеРеквизиты Цикл			
				Если ЗначениеЗаполнено(ДопРеквизит.Значение) ТОгда
					Структура = Новый Структура;
					Структура.Вставить("Свойство",ДопРеквизит.Свойство);
					Структура.Вставить("Значение",ДопРеквизит.Значение);
					НайденоСвойство=Номенклатура.ДополнительныеРеквизиты.НайтиСтроки(Структура).Количество()>0;
					ЕСли  НайденоСвойство и ДопРеквизит.Исключить ТОгда
						ИспользоватьЭтоПравило=Ложь;
						Прервать;
					ИначеЕсли НЕ НайденоСвойство и НЕ  ДопРеквизит.Исключить ТОгда
						ИспользоватьЭтоПравило=Ложь; 
						Прервать;				
					КонецЕсли;				
				КонецЕсли;
			КонецЦикла; 
		КонецЕсли;
		
		Если ИспользоватьЭтоПравило Тогда
			Возврат Выборка.Ссылка;
		КонецЕсли;			
		
	КонецЦикла;
	

КонецФункции

Функция ОпределитьПравило2(Номенклатура,ДокументРасхода=Неопределено) Экспорт
	УстановитьПривилегированныйРежим(Истина);
		
	Если ДокументРасхода=Неопределено Тогда
		ДокументРасхода=Документы.Лико_ПередачаТоваров.ПустаяСсылка();
	КонецЕсли;
	
	НастройкаПравил= ПолучитьНастройкуПравил(Номенклатура.ВидНоменклатуры, ДокументРасхода.Организация);
	Если Не ЗначениеЗаполнено(НастройкаПравил) ИЛИ не ЗначениеЗаполнено(НастройкаПравил.ТекстЗапроса) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = НастройкаПравил.ТекстЗапроса;
	
	Для каждого Параметр Из НастройкаПравил.ПараметрыЗапроса Цикл
		Запрос.УстановитьПараметр(Параметр.Ключ,Параметр.Значение); 		
	КонецЦикла;
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
	Запрос.УстановитьПараметр("ДокументРасхода",ДокументРасхода);




	
	ПакетЗапроса = Запрос.ВыполнитьПакет();
	Ном =0;
	Для каждого Пакет Из ПакетЗапроса Цикл
		Если Не Пакет.Пустой() ТОгда
			Возврат НастройкаПравил.СоответствиеПравил[Ном];
		КонецЕсли;
		
	Ном=Ном+1;		
КонецЦикла;

КонецФункции

Процедура СохранитьНастройкуПравил(ВидНоменклатуры, Организация) Экспорт

	СоответствиеПравил= Новый Соответствие;

		Запрос = Новый Запрос;
	Запрос.Текст=ТекстЗапросаПравилПоВидуНоменклатуры(); 
	Запрос.УстановитьПараметр("ВидНоменклатуры",ВидНоменклатуры );
	Запрос.УстановитьПараметр("Организация",Организация );
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	ТекстЗапроса="";
	НомерЗапроса=1;
	ПараметрыЗапроса=Новый Структура;
	Ном=0;
	Пока Выборка.Следующий() Цикл 		
		СоответствиеПравил.Вставить(Ном,Выборка.Ссылка);
		СформироватьЗапросИзСКД(Выборка,ТекстЗапроса,ПараметрыЗапроса,НомерЗапроса);		
		НомерЗапроса=НомерЗапроса+1;		 
		Ном=Ном+1;	
	КонецЦикла;
	
	Структура=Новый Структура;
	Структура.Вставить("СоответствиеПравил",СоответствиеПравил);
	Структура.Вставить("ТекстЗапроса",ТекстЗапроса);
	Структура.Вставить("ПараметрыЗапроса",ПараметрыЗапроса);


	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_ПравилаСписанияНоменклатурыПодЗаказ.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Лико_ПравилаСписанияНоменклатурыПодЗаказ КАК Лико_ПравилаСписанияНоменклатурыПодЗаказ
	|ГДЕ
	|	Лико_ПравилаСписанияНоменклатурыПодЗаказ.ВидНоменклатуры = &ВидНоменклатуры
	|	И Лико_ПравилаСписанияНоменклатурыПодЗаказ.ЭтоГруппа
	|	И Лико_ПравилаСписанияНоменклатурыПодЗаказ.Организация = &Организация";
	Запрос.УстановитьПараметр("ВидНоменклатуры",ВидНоменклатуры );
	Запрос.УстановитьПараметр("Организация",Организация );
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		СпрОбъект=Выборка.Ссылка.ПолучитьОбъект();
		СпрОбъект.НастройкаПравил=Новый ХранилищеЗначения(Структура);
	СпрОбъект.Записать();		
	КонецЦикла; 
	
	
	



		
КонецПроцедуры //-Лико m.shenderov 08.07.2020

Функция ПолучитьПриоритетМакс(ВидНоменклатуры, Организация) Экспорт 
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МАКСИМУМ(Лико_ПравилаСписанияНоменклатурыПодЗаказ.Приоритет) КАК Приоритет
	|ИЗ
	|	Справочник.Лико_ПравилаСписанияНоменклатурыПодЗаказ КАК Лико_ПравилаСписанияНоменклатурыПодЗаказ
	|ГДЕ
	|	Лико_ПравилаСписанияНоменклатурыПодЗаказ.ВидНоменклатуры = &ВидНоменклатуры
	|	И Лико_ПравилаСписанияНоменклатурыПодЗаказ.Организация = &Организация";
	Запрос.УстановитьПараметр("ВидНоменклатуры",ВидНоменклатуры );
	Запрос.УстановитьПараметр("Организация",Организация );

	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.Приоритет) Тогда
			Возврат Выборка.Приоритет;
		КонецЕсли;
		
	КонецЦикла; 
	
	Возврат 0;	
КонецФункции //-Лико m.shenderov 28.12.2018 

Процедура ПереместитьПоПриоритету(Ссылка,Шаг) Экспорт 
	
	
	ТекущийПриоритет	=	Ссылка.Приоритет;
	НовыйПриоритет		=	ТекущийПриоритет+Шаг;
	
	Если НовыйПриоритет=0 Или НовыйПриоритет=ПолучитьПриоритетМакс(Ссылка.ВидНоменклатуры, Ссылка.Организация)+1 Тогда
		Возврат;
	КонецЕсли;
	
	ПравилоКонкурент=ПолучитьПравилоПоПриоритету(Ссылка.ВидНоменклатуры,НовыйПриоритет);
	
	НачатьТранзакцию();
	
	СправочникОбъект			=Ссылка.ПолучитьОбъект();
	СправочникОбъект.Приоритет	=НовыйПриоритет; 	
	СправочникОбъект.Записать();
	Если ЗначениеЗаполнено(ПравилоКонкурент) Тогда
		
		СправочникОбъект			 =ПравилоКонкурент.ПолучитьОбъект();
		СправочникОбъект.Приоритет	 =СправочникОбъект.Приоритет-Шаг; 	
		СправочникОбъект.Записать();
	КонецЕсли;
	
	
	
	
	ЗафиксироватьТранзакцию();
	
	
	
КонецПроцедуры //-Лико m.shenderov 28.12.2018

Функция ПолучитьПравилоПоПриоритету(ВидНоменклатуры,Приоритет) Экспорт 
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Док.Ссылка КАК Ссылка ИЗ Справочник.Лико_ПравилаСписанияНоменклатурыПодЗаказ КАК Док
	|ГДЕ Док.ВидНоменклатуры = &ВидНоменклатуры И Док.Приоритет = &Приоритет";
	Запрос.УстановитьПараметр("ВидНоменклатуры",ВидНоменклатуры);
	Запрос.УстановитьПараметр("Приоритет",Приоритет);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Возврат Выборка.Ссылка;	
		
	КонецЦикла; 
	
	
КонецФункции //-Лико m.shenderov 29.12.2018 

 
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции



Функция ТекстЗапросаПравилПоВидуНоменклатуры()
	
	Возврат 
	"ВЫБРАТЬ
	|	Лико_ПравилаСписанияНоменклатурыПодЗаказ.Ссылка КАК Ссылка,
	|	Лико_ПравилаСписанияНоменклатурыПодЗаказ.ВерсияДанных КАК ВерсияДанных,
	|	Лико_ПравилаСписанияНоменклатурыПодЗаказ.ПометкаУдаления КАК ПометкаУдаления,
	|	Лико_ПравилаСписанияНоменклатурыПодЗаказ.Код КАК Код,
	|	Лико_ПравилаСписанияНоменклатурыПодЗаказ.Наименование КАК Наименование,
	|	Лико_ПравилаСписанияНоменклатурыПодЗаказ.Выключить КАК Выключить,
	|	Лико_ПравилаСписанияНоменклатурыПодЗаказ.Организация КАК Организация,
	|	Лико_ПравилаСписанияНоменклатурыПодЗаказ.ВидНоменклатуры КАК ВидНоменклатуры,
	|	Лико_ПравилаСписанияНоменклатурыПодЗаказ.Описание КАК Описание,
	|	Лико_ПравилаСписанияНоменклатурыПодЗаказ.Предопределенный КАК Предопределенный,
	|	Лико_ПравилаСписанияНоменклатурыПодЗаказ.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных,
	|	Лико_ПравилаСписанияНоменклатурыПодЗаказ.СложнаяНастройка КАК СложнаяНастройка,
	|	Лико_ПравилаСписанияНоменклатурыПодЗаказ.ОтборНастройки КАК ОтборНастройки,
	|	Лико_ПравилаСписанияНоменклатурыПодЗаказ.Приоритет КАК Приоритет,
	|	Лико_ПравилаСписанияНоменклатурыПодЗаказ.КатегорияЭксплуатации КАК КатегорияЭксплуатации,
	|	Лико_ПравилаСписанияНоменклатурыПодЗаказ.ТипСписания КАК ТипСписания
	|ИЗ
	|	Справочник.Лико_ПравилаСписанияНоменклатурыПодЗаказ КАК Лико_ПравилаСписанияНоменклатурыПодЗаказ
	|ГДЕ
	|	Лико_ПравилаСписанияНоменклатурыПодЗаказ.ВидНоменклатуры = &ВидНоменклатуры
	|	И НЕ Лико_ПравилаСписанияНоменклатурыПодЗаказ.ПометкаУдаления
	|	И НЕ Лико_ПравилаСписанияНоменклатурыПодЗаказ.Выключить
	|	И Лико_ПравилаСписанияНоменклатурыПодЗаказ.Организация = &Организация
	|
	|УПОРЯДОЧИТЬ ПО
	|	Приоритет";
	
КонецФункции

Процедура УстановитьЗначениеПараметраНастроек(Настройки, ИмяПараметра, Значение)
	
	Параметр = Настройки.ПараметрыДанных.Элементы.Найти(ИмяПараметра);
	
	Если Параметр <> Неопределено Тогда
		Параметр.Значение = Значение;
		Параметр.Использование = Истина;
	КонецЕсли;
	
КонецПроцедуры

Функция ИспользоватьПравилоСКД(Выборка, Номенклатура,ДокументРасхода)
	УстановитьПривилегированныйРежим(Истина);
	ОтборНастройки= Новый КомпоновщикНастроекКомпоновкиДанных;
    СхемаКомпоновкиДанных = Справочники.Лико_МастерНастройкиСтатьиРасходаДляНоменклатуры.ПолучитьМакет("ОтборПоУсловию");
	//URLСхемы = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, Новый УникальныйИдентификатор());
   ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных);
   ОтборНастройки.Инициализировать(ИсточникНастроек);
   	ТекНастройки = Выборка.ОтборНастройки.Получить();
	
	Если ТекНастройки = Неопределено Тогда
		ОтборНастройки.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	Иначе
		ОтборНастройки.ЗагрузитьНастройки(ТекНастройки);
	КонецЕсли;
	//ОтборНастройки.Восстановить(СпособВосстановленияНастроекКомпоновкиДанных.ПроверятьДоступность);
	Если Не ЗначениеЗаполнено(ДокументРасхода) Тогда
		ДокументРасхода=Документы.Лико_ПередачаТоваров.ПустаяСсылка();
	КонецЕсли;
	
	УстановитьЗначениеПараметраНастроек(ОтборНастройки.Настройки, "Номенклатура" , Номенклатура);
	УстановитьЗначениеПараметраНастроек(ОтборНастройки.Настройки, "ДокументРасхода", ДокументРасхода);

	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки   = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, ОтборНастройки.ПолучитьНастройки(),,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;

	Если 	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных).Количество()>0 Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли; 	
КонецФункции

Функция ПолучитьНастройкуПравил(ВидНоменклатуры, Организация) //+Лико m.shenderov 09.07.2020
	//СтатьяРасходов=Неопределено;	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_ПравилаСписанияНоменклатурыПодЗаказ.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Лико_ПравилаСписанияНоменклатурыПодЗаказ КАК Лико_ПравилаСписанияНоменклатурыПодЗаказ
	|ГДЕ
	|	Лико_ПравилаСписанияНоменклатурыПодЗаказ.ВидНоменклатуры = &ВидНоменклатуры
	|	И Лико_ПравилаСписанияНоменклатурыПодЗаказ.ЭтоГруппа
	|	И Лико_ПравилаСписанияНоменклатурыПодЗаказ.Организация = &Организация";
	Запрос.УстановитьПараметр("ВидНоменклатуры",ВидНоменклатуры );
	Запрос.УстановитьПараметр("Организация",Организация );
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой()Тогда
		Возврат Неопределено;
	КонецЕсли;
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
	     Возврат Выборка.Ссылка.НастройкаПравил.Получить();

	КонецЦикла;  
	
	
	
КонецФункции //-Лико m.shenderov 09.07.2020 

Процедура СформироватьЗапросИзСКД(Выборка,ТекстЗапроса="",ПараметрыЗапроса,НомерЗапроса) //+Лико m.shenderov 30.12.2018
	ОтборНастройки= Новый КомпоновщикНастроекКомпоновкиДанных;
	СхемаКомпоновкиДанных = Справочники.Лико_МастерНастройкиСтатьиРасходаДляНоменклатуры.ПолучитьМакет("ОтборПоУсловию");
	//URLСхемы = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, Новый УникальныйИдентификатор());
	ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных);
	ОтборНастройки.Инициализировать(ИсточникНастроек);
	ТекНастройки = Выборка.ОтборНастройки.Получить();
	
	Если ТекНастройки = Неопределено Тогда
		ОтборНастройки.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	Иначе
		ОтборНастройки.ЗагрузитьНастройки(ТекНастройки);
	КонецЕсли;
	//ОтборНастройки.Восстановить(СпособВосстановленияНастроекКомпоновкиДанных.ПроверятьДоступность);
	//УстановитьЗначениеПараметраНастроек(ОтборНастройки.Настройки, "Номенклатура" , Номенклатура);
	//УстановитьЗначениеПараметраНастроек(ОтборНастройки.Настройки, "ДокументРасхода", ДокументРасхода);
	КоличествоПараметров=СхемаКомпоновкиДанных.Параметры.Количество();
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки   = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, ОтборНастройки.ПолучитьНастройки(),,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	Запрос=МакетКомпоновки.НаборыДанных.НаборДанных1.Запрос;
	ПрефиксПараметра="_"+Формат(НомерЗапроса,"ЧДЦ=0; ЧГ=0");

	Для каждого Параметр Из МакетКомпоновки.ЗначенияПараметров Цикл
		КоличествоПараметров=КоличествоПараметров-1;
		Если КоличествоПараметров>=0 ТОгда
			ПараметрыЗапроса.Вставить(Параметр.Имя,Параметр.Значение);
			
		иначе
			
			НовоеИмяПараметра=СтрЗаменить(Параметр.Имя,"П","П"+ПрефиксПараметра);

			ПараметрыЗапроса.Вставить(НовоеИмяПараметра,Параметр.Значение);
			//Запрос=СтрЗаменить(Запрос,"&"+Параметр.Имя,"&"+НовоеИмяПараметра);
		КонецЕсли;
	КонецЦикла;
	Запрос=СтрЗаменить(Запрос,"&П","&П"+ПрефиксПараметра);

	Если ТекстЗапроса="" Тогда
		ТекстЗапроса=Запрос;
	Иначе
		ТекстЗапроса=ТекстЗапроса+"
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|"+Запрос; 		
	КонецЕсли; 	
КонецПроцедуры //-Лико m.shenderov 30.12.2018 




Функция СписаниеВЗаказУдалить(Номенклатура) Экспорт
	УстановитьБезопасныйРежим(Истина);
	СтатьяРасходов=Неопределено;	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЛикоМастерНастройкиСтатьиРасходаДляНоменклатуры.Ссылка КАК Ссылка,
	|	ЛикоМастерНастройкиСтатьиРасходаДляНоменклатуры.ВерсияДанных КАК ВерсияДанных,
	|	ЛикоМастерНастройкиСтатьиРасходаДляНоменклатуры.ПометкаУдаления КАК ПометкаУдаления,
	|	ЛикоМастерНастройкиСтатьиРасходаДляНоменклатуры.Код КАК Код,
	|	ЛикоМастерНастройкиСтатьиРасходаДляНоменклатуры.Наименование КАК Наименование,
	|	ЛикоМастерНастройкиСтатьиРасходаДляНоменклатуры.Выключить КАК Выключить,
	|	ЛикоМастерНастройкиСтатьиРасходаДляНоменклатуры.Организация КАК Организация,
	|	ЛикоМастерНастройкиСтатьиРасходаДляНоменклатуры.ВидНоменклатуры КАК ВидНоменклатуры,
	|	ЛикоМастерНастройкиСтатьиРасходаДляНоменклатуры.Описание КАК Описание,
	|	ЛикоМастерНастройкиСтатьиРасходаДляНоменклатуры.Предопределенный КАК Предопределенный,
	|	ЛикоМастерНастройкиСтатьиРасходаДляНоменклатуры.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных
	|ИЗ
	|	Справочник.Лико_ПравилаСписанияНоменклатурыПодЗаказ КАК ЛикоМастерНастройкиСтатьиРасходаДляНоменклатуры
	|ГДЕ
	|	ЛикоМастерНастройкиСтатьиРасходаДляНоменклатуры.ВидНоменклатуры = &ВидНоменклатуры
	|	И НЕ ЛикоМастерНастройкиСтатьиРасходаДляНоменклатуры.ПометкаУдаления
	|	И НЕ ЛикоМастерНастройкиСтатьиРасходаДляНоменклатуры.Выключить";
	Запрос.УстановитьПараметр("ВидНоменклатуры",Номенклатура.ВидНоменклатуры );
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл 		
		ИспользоватьЭтоПравило=Истина;	
		Для каждого ДопРеквизит Из Выборка.Ссылка.ДополнительныеРеквизиты Цикл			
			Если ЗначениеЗаполнено(ДопРеквизит.Значение) ТОгда
				Структура = Новый Структура;
				Структура.Вставить("Свойство",ДопРеквизит.Свойство);
				Структура.Вставить("Значение",ДопРеквизит.Значение);
				НайденоСвойство=Номенклатура.ДополнительныеРеквизиты.НайтиСтроки(Структура).Количество()>0;
				ЕСли  НайденоСвойство и ДопРеквизит.Исключить ТОгда
					ИспользоватьЭтоПравило=Ложь;
					Прервать;
				ИначеЕсли НЕ НайденоСвойство и НЕ  ДопРеквизит.Исключить ТОгда
					ИспользоватьЭтоПравило=Ложь; 
					Прервать;				
				КонецЕсли;				
			КонецЕсли;
		КонецЦикла; 
		Если ИспользоватьЭтоПравило Тогда
			Возврат Истина;
		КонецЕсли;			
		
	КонецЦикла;
	
	Возврат Ложь ;
КонецФункции

Функция ОпределитьПравилоУдалить(Номенклатура) Экспорт
	СтатьяРасходов=Неопределено;	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЛикоМастерНастройкиСтатьиРасходаДляНоменклатуры.Ссылка КАК Ссылка,
	|	ЛикоМастерНастройкиСтатьиРасходаДляНоменклатуры.ВерсияДанных КАК ВерсияДанных,
	|	ЛикоМастерНастройкиСтатьиРасходаДляНоменклатуры.ПометкаУдаления КАК ПометкаУдаления,
	|	ЛикоМастерНастройкиСтатьиРасходаДляНоменклатуры.Код КАК Код,
	|	ЛикоМастерНастройкиСтатьиРасходаДляНоменклатуры.Наименование КАК Наименование,
	|	ЛикоМастерНастройкиСтатьиРасходаДляНоменклатуры.Выключить КАК Выключить,
	|	ЛикоМастерНастройкиСтатьиРасходаДляНоменклатуры.Организация КАК Организация,
	|	ЛикоМастерНастройкиСтатьиРасходаДляНоменклатуры.ВидНоменклатуры КАК ВидНоменклатуры,
	|	ЛикоМастерНастройкиСтатьиРасходаДляНоменклатуры.Описание КАК Описание,
	|	ЛикоМастерНастройкиСтатьиРасходаДляНоменклатуры.Предопределенный КАК Предопределенный,
	|	ЛикоМастерНастройкиСтатьиРасходаДляНоменклатуры.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных
	|ИЗ
	|	Справочник.Лико_ПравилаСписанияНоменклатурыПодЗаказ КАК ЛикоМастерНастройкиСтатьиРасходаДляНоменклатуры
	|ГДЕ
	|	ЛикоМастерНастройкиСтатьиРасходаДляНоменклатуры.ВидНоменклатуры = &ВидНоменклатуры
	|	И НЕ ЛикоМастерНастройкиСтатьиРасходаДляНоменклатуры.ПометкаУдаления
	|	И НЕ ЛикоМастерНастройкиСтатьиРасходаДляНоменклатуры.Выключить";
	Запрос.УстановитьПараметр("ВидНоменклатуры",Номенклатура.ВидНоменклатуры );
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл 		
		ИспользоватьЭтоПравило=Истина;	
		Для каждого ДопРеквизит Из Выборка.Ссылка.ДополнительныеРеквизиты Цикл			
			Если ЗначениеЗаполнено(ДопРеквизит.Значение) ТОгда
				Структура = Новый Структура;
				Структура.Вставить("Свойство",ДопРеквизит.Свойство);
				Структура.Вставить("Значение",ДопРеквизит.Значение);
				НайденоСвойство=Номенклатура.ДополнительныеРеквизиты.НайтиСтроки(Структура).Количество()>0;
				ЕСли  НайденоСвойство и ДопРеквизит.Исключить ТОгда
					ИспользоватьЭтоПравило=Ложь;
					Прервать;
				ИначеЕсли НЕ НайденоСвойство и НЕ  ДопРеквизит.Исключить ТОгда
					ИспользоватьЭтоПравило=Ложь; 
					Прервать;				
				КонецЕсли;				
			КонецЕсли;
		КонецЦикла; 
		Если ИспользоватьЭтоПравило Тогда
			Возврат Выборка.Ссылка;
		КонецЕсли;			
	КонецЦикла;   	
КонецФункции

Функция ОпределитьПравило101224(Номенклатура,ДокументРасхода=Неопределено) Экспорт
	Если ДокументРасхода=Неопределено Тогда
		ДокументСписания=Документы.Лико_ПередачаТоваров.ПустаяСсылка();
	КонецЕсли;
	СтатьяРасходов=Неопределено;	
	Запрос = Новый Запрос;
	Запрос.Текст=ТекстЗапросаПравилПоВидуНоменклатуры(); 
	Запрос.УстановитьПараметр("ВидНоменклатуры",Номенклатура.ВидНоменклатуры );
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл 		
		ИспользоватьЭтоПравило=Истина;	
		Если Выборка.СложнаяНастройка Тогда 
			ИспользоватьЭтоПравило= ИспользоватьПравилоСКД(Выборка,Номенклатура,ДокументРасхода);		
			
		Иначе
			Для каждого ДопРеквизит Из Выборка.Ссылка.ДополнительныеРеквизиты Цикл			
				Если ЗначениеЗаполнено(ДопРеквизит.Значение) ТОгда
					Структура = Новый Структура;
					Структура.Вставить("Свойство",ДопРеквизит.Свойство);
					Структура.Вставить("Значение",ДопРеквизит.Значение);
					НайденоСвойство=Номенклатура.ДополнительныеРеквизиты.НайтиСтроки(Структура).Количество()>0;
					ЕСли  НайденоСвойство и ДопРеквизит.Исключить ТОгда
						ИспользоватьЭтоПравило=Ложь;
						Прервать;
					ИначеЕсли НЕ НайденоСвойство и НЕ  ДопРеквизит.Исключить ТОгда
						ИспользоватьЭтоПравило=Ложь; 
						Прервать;				
					КонецЕсли;				
				КонецЕсли;
			КонецЦикла; 
		КонецЕсли;
		
		Если ИспользоватьЭтоПравило Тогда
			Возврат Выборка.Ссылка;
		КонецЕсли;			
		
	КонецЦикла;
	
	
КонецФункции

Функция ИспользоватьПравилоСКД121024(Выборка,Номенклатура,ДокументРасхода) //+Лико m.shenderov 30.12.2018
	ОтборНастройки= Новый КомпоновщикНастроекКомпоновкиДанных;
	СхемаКомпоновкиДанных = Справочники.Лико_МастерНастройкиСтатьиРасходаДляНоменклатуры.ПолучитьМакет("ОтборПоУсловию");
	//URLСхемы = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, Новый УникальныйИдентификатор());
	ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных);
	ОтборНастройки.Инициализировать(ИсточникНастроек);
	ТекНастройки = Выборка.ОтборНастройки.Получить();
	
	Если ТекНастройки = Неопределено Тогда
		ОтборНастройки.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	Иначе
		ОтборНастройки.ЗагрузитьНастройки(ТекНастройки);
	КонецЕсли;
	//ОтборНастройки.Восстановить(СпособВосстановленияНастроекКомпоновкиДанных.ПроверятьДоступность);
	УстановитьЗначениеПараметраНастроек(ОтборНастройки.Настройки, "Номенклатура" , Номенклатура);
	УстановитьЗначениеПараметраНастроек(ОтборНастройки.Настройки, "ДокументРасхода", ДокументРасхода);
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки   = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, ОтборНастройки.ПолучитьНастройки(),,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	
	Если 	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных).Количество()>0 Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли; 	
КонецФункции //-Лико m.shenderov 30.12.2018 


#КонецОбласти

#КонецЕсли
